Revit 2024 API
ParameterTypeId.FbxLightEmitRectangleWidth Property
 "Emit from Rectangle Width"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FbxLightEmitRectangleWidth { get; }
Visual Basic
Public Shared ReadOnly Property FbxLightEmitRectangleWidth As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FbxLightEmitRectangleWidth {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace